{
  "timelineItems": [
    {
      "year": "Aug 2024 - Present",
      "title": "Senior Software Engineer",
      "description": "Wipro Limited, Bangalore | Leading enterprise frontend architecture and team of 5 engineers.",
      "logo": "wipro-white.svg",
      "details": [
        "Owned frontend architecture for large-scale enterprise platform with strategic UI decisions",
        "Led and mentored 5 engineers, improving delivery quality and consistency",
        "Migrated 6 production-grade applications from Blazor to Angular with modular, scalable architecture",
        "Reduced JavaScript bundle size by ~30% using code splitting and lazy loading, improving initial load time by ~40%",
        "Improved Time to Interactive (TTI) by ~35% by optimizing change detection and rendering paths",
        "Led production rollout and resolved performance regressions and critical UI defects"
      ]
    },
    {
      "year": "Jul 2023 - Jul 2024",
      "title": "Software Engineer I",
      "description": "Harman International Industries, Bangalore | Designed reusable components and dynamic UI framework.",
      "logo": "harman-international-logo.svg",
      "details": [
        "Designed and shipped 30+ production-ready reusable Angular components used across 6+ different products",
        "Architected JSON-driven dynamic UI rendering framework, improving feature delivery speed by ~10×",
        "Introduced TDD practices achieving 60% unit test coverage and reducing post-release defects by ~50%",
        "Worked closely with multiple product teams to onboard the rendering framework and standardize UI patterns"
      ]
    },
    {
      "year": "Apr 2020 - Jun 2023",
      "title": "Software Engineer",
      "description": "Harman International Industries, Bangalore | Owned critical frontend modules using Angular and RxJS.",
      "logo": "harman-international-logo.svg",
      "details": [
        "Owned and developed critical frontend modules using Angular, TypeScript, and RxJS for automotive infotainment systems",
        "Collaborated closely with UX, backend, and product teams to deliver features on aggressive timelines",
        "Improved UI reliability and responsiveness by resolving performance bottlenecks and production defects",
        "Implemented advanced state management using RxJS, reducing component complexity by 40% and improving maintainability",
        "Mentored junior developers on Angular best practices, code patterns, and frontend architecture principles",
        "Led code reviews and established frontend coding standards, improving code quality across the team"
      ]
    },
    {
      "year": "Dec 2017 - Mar 2020",
      "title": "Application Developer",
      "description": "Conduent Business Services, Bangalore | Built secure document processing workflows.",
      "logo": "conduent-white.svg",
      "details": [
        "Designed configurable UI modules supporting 36 customer-specific workflows",
        "Built secure Patient Health Information document processing workflows used by 150+ hospitals",
        "Led migration from Silverlight to Angular, reducing installer size by ~75%",
        "Validated workflows with QA and business stakeholders to meet healthcare compliance requirements"
      ]
    },
    {
      "year": "Feb 2017 - May 2017",
      "title": "PG-Diploma in Advanced Computing",
      "description": "Centre for Development of Advanced Computing, Bangalore",
      "logo": "cdac-white.svg",
      "details": [
        "Completed intensive advanced computing program",
        "Specialized in modern software development practices",
        "Foundation for enterprise-scale application development"
      ]
    },
    {
      "year": "Aug 2010 - Jul 2014",
      "title": "Bachelors in Computer Science",
      "description": "Jaypee Institute of Information Technology, Noida",
      "logo": "jiit.png",
      "details": [
        "Four-year engineering degree program",
        "Core coursework in algorithms, data structures, and system design",
        "Foundation in programming languages and software engineering"
      ]
    }
  ]
}
